dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/UART5_1.0.xml
    <register id="UART5_STAT" width="32" offset="0x1108" description="UART Status Register">
        <bitfield id="BUSY" description="UART Busy
This bit is set as soon as the transmit FIFO or TXDATA register becomes non-empty (regardless of whether UART is enabled) or if a receive data is currently ongoing (after the start edge have been detected until a complete byte, including all stop bits, has been received by the shift register).
In IDLE_Line mode the Busy signal also stays set during the idle time generation." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The UART is not busy."/>
            <bitenum id="SET" value="0x1" description="The UART is busy transmitting data. This bit remains set until the complete byte, including all stop bits, has been sent/received from/into the shift register."/>
        </bitfield>
        <bitfield id="TXFF" description="UART Transmit FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="7" end="7" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitter is not full."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the transmit holding register is full. If the FIFO is enabled (FEN is 1), the transmit FIFO is full."/>
        </bitfield>
        <bitfield id="RXFF" description="UART Receive FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The receiver can receive data."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the receive holding register is full. If the FIFO is enabled (FEN is 1), the receive FIFO is full."/>
        </bitfield>
        <bitfield id="TXFE" description="UART Transmit FIFO Empty  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitter has data to transmit."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the transmit holding register is empty. If the FIFO is enabled (FEN is 1), the transmit FIFO is empty."/>
        </bitfield>
        <bitfield id="CTS" description="Clear To Send" begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The CTS signal is not asserted (high)."/>
            <bitenum id="SET" value="0x1" description="The CTS signal is asserted (low)."/>
        </bitfield>
        <bitfield id="IDLE" description="IDLE mode has been detected in Idleline-Multiprocessor-Mode.
The IDLE bit is used as an address tag for each block of characters. In idle-line multiprocessor format, this bit is set when a received character is an address." begin="9" end="9" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="IDLE has not been detected before last received character. (In idle-line multiprocessor mode)."/>
            <bitenum id="SET" value="0x1" description="IDLE has been detected before last received character. (In idle-line multiprocessor mode)."/>
        </bitfield>
        <bitfield id="RXFE" description="UART Receive FIFO Empty  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The receiver is not empty."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the receive holding register is empty. If the FIFO is enabled (FEN is 1), the receive FIFO is empty."/>
        </bitfield>
    </register>
    <register id="UART5_IFLS" width="32" offset="0x110C" description="UART Interrupt FIFO Level Select Register">
        <bitfield id="TXIFLSEL" description="UART Transmit Interrupt FIFO Level Select  The trigger points for the transmit interrupt are as follows: 
Note: for undefined settings the default configuration is used." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="LVL_3_4" value="0x1" description="TX FIFO &lt;= 3/4 empty"/>
            <bitenum id="LVL_1_2" value="0x2" description="TX FIFO &lt;= 1/2 empty (default)"/>
            <bitenum id="LVL_1_4" value="0x3" description="TX FIFO &lt;= 1/4 empty"/>
            <bitenum id="LVL_EMPTY" value="0x5" description="TX FIFO is empty"/>
            <bitenum id="LVL_1" value="0x7" description="TX FIFO &gt;= 1 entry free Note: esp. required for DMA Trigger"/>
        </bitfield>
        <bitfield id="RXIFLSEL" description="UART Receive Interrupt FIFO Level Select  The trigger points for the receive interrupt are as follows: 

Note: 
  In ULP domain the trigger levels are used for:
  0: LVL_1_4
  4: LVL_FULL
  For undefined settings the default configuration is used." begin="6" end="4" width="3" rwaccess="R/W">
            <bitenum id="LVL_1_4_RES" value="0x0" description="RX FIFO &gt;= 1/4 full Note: For ULP Domain"/>
            <bitenum id="LVL_1_4" value="0x1" description="RX FIFO &gt;= 1/4 full"/>
            <bitenum id="LVL_1_2" value="0x2" description="RX FIFO &gt;= 1/2 full (default)"/>
            <bitenum id="LVL_3_4" value="0x3" description="RX FIFO &gt;= 3/4 full"/>
            <bitenum id="LVL_FULL_RES" value="0x4" description="RX FIFO is full Note: For ULP Domain"/>
            <bitenum id="LVL_FULL" value="0x5" description="RX FIFO is full"/>
            <bitenum id="LVL_1" value="0x7" description="RX FIFO &gt;= 1 entry available Note: esp. required for DMA Trigger"/>
        </bitfield>
        <bitfield id="RXTOSEL" description="UART Receive Interrupt Timeout Select. When receiving no start edge for an additional character within the set bittimes a RX interrupt is set even if the FIFO level is not reached. A value of 0 disables this function." begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UART5_IBRD" width="32" offset="0x1110" description="UART Integer Baud-Rate Divisor Register">
        <bitfield id="DIVINT" description="Integer Baud-Rate Divisor" begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UART5_FBRD" width="32" offset="0x1114" description="UART Fractional Baud-Rate Divisor Register">
        <bitfield id="DIVFRAC" description="Fractional Baud-Rate Divisor" begin="5" end="0" width="6" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3F" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UART5_GFCTL" width="32" offset="0x1118" description="Glitch Filter Control">
        <bitfield id="CHAIN" description="Analog and digital noise filters chaining enable.
        0 DISABLE: When 0, chaining is disabled and only digital filter output is available to IP logic for sampling
        1 ENABLE: When 1, analog and digital glitch filters are chained and the output of the combination is made available to IP logic for sampling" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLED" value="0x0" description="Disabled"/>
            <bitenum id="ENABLED" value="0x1" description="Enabled"/>
        </bitfield>
    </register>
    <register id="UART5_TXDATA" width="32" offset="0x1120" description="UART Transmit Data Register">
        <bitfield id="DATA" description="Data Transmitted or Received  Data that is to be transmitted via the UART is written to this field.  When read, this field contains the data that was received by the UART." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UART5_RXDATA" width="32" offset="0x1124" description="UART Receive Data Register">
        <bitfield id="DATA" description="Received Data.  When read, this field contains the data that was received by the UART." begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="FRMERR" description="UART Framing Error  Writing to this bit has no effect. The flag is cleared by writing 1 to the FRMERR bit in the UART EVENT ICLR register. This error is associated with the character at the top of the FIFO." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No framing error has occurred"/>
            <bitenum id="SET" value="0x1" description="The received character does not have a valid stop bit sequence, which is one or two stop bits depending on the UARTLCRH.STP2 setting (a valid stop bit is 1)."/>
        </bitfield>
        <bitfield id="PARERR" description="UART Parity Error   Writing to this bit has no effect. The flag is cleared by writing 1 to the PARERR bit in the UART EVENT ICLR register." begin="9" end="9" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No parity error has occurred"/>
            <bitenum id="SET" value="0x1" description="The parity of the received data character does not match the parity defined by bits 2 and 7 of the UARTLCRH register."/>
        </bitfield>
        <bitfield id="BRKERR" description="UART Break Error  Writing to this bit has no effect. The flag is cleared by writing 1 to the BRKERR bit in the UART EVENT ICLR register. This error is associated with the character at the top of the FIFO. When a break occurs, only one 0 character is loaded into the FIFO. The next character is only enabled after the receive data input goes to a 1 (marking state) and the next valid start bit is received." begin="10" end="10" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No break condition has occurred"/>
            <bitenum id="SET" value="0x1" description="A break condition has been detected, indicating that the receive data input was held low for longer than a full-word transmission time (defined as start, data, parity, and stop bits)."/>
        </bitfield>
        <bitfield id="OVRERR" description="UART Receive Overrun Error  Writing to this bit has no effect. The flag is cleared by writing 1 to the OVRERR bit in the UART EVENT ICLR register.  In case of a receive FIFO overflow, the FIFO contents remain valid because no further data is written when the FIFO is full. Only the contents of the shift register are overwritten. The CPU must read the data in order to empty the FIFO." begin="11" end="11" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No data has been lost due to a receive overrun."/>
            <bitenum id="SET" value="0x1" description="New data was received but could not be stored, because the previous data was not read (resulting in data loss)."/>
        </bitfield>
        <bitfield id="NERR" description="Noise Error.
Writing to this bit has no effect. The flag is cleared by writing 1 to the NERR bit in the UART EVENT ICLR register." begin="12" end="12" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No noise error occured"/>
            <bitenum id="SET" value="0x1" description="Noise error occured during majority voting"/>
        </bitfield>
    </register>
    <register id="UART5_AMASK" width="32" offset="0x1148" description="Self Address Mask Register">
        <bitfield id="MSK" description="Self Address Mask for 9-Bit Mode  This field contains the address mask that creates a set of addresses that should be matched.  A 0 bit in the MSK bitfield configures, that the corresponding bit in the ADDR bitfield of the UARTxADDR register is don't care. A 1 bit in the MSK bitfield configures, that the corresponding bit in the ADDR bitfield of the UARTxADDR register must match." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UART5_ADDR" width="32" offset="0x114C" description="Self Address Register">
        <bitfield id="ADDR" description="Self Address for 9-Bit Mode  This field contains the address that should be matched when UARTxAMASK is FFh." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>

</module>